# Movies - Database
- Andrea Cohen
- 03.04.23

## Business Problem:
- to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset
- to use this database to analyze what makes a movie successful
- to provide recommendations to the stakeholder on how to make a successful movie

## Tasks:
- Download several files from IMDB’s movie data set and filter out the subset of moves requested by the stakeholder.
- Use an API to extract box office revenue and profit data to add to the IMDB data and perform exploratory data analysis.
- Construct and export a MySQL database using the data.
- Apply hypothesis testing to explore what makes a movie successful.
- Produce a Linear Regression model to predict movie performance.

## Database Task:
- apply an E.T.L process on the previously saved movie data
- create a new MySQL database after preparing the data for a relational database
- export the database to a .sql file

## Data:

Data Location - The dataset files can be accessed and downloaded from https://datasets.imdbws.com/. The data is refreshed daily.

Data Source - TMDB

![png](TMDB1024_1.png)

IMDb Dataset Details -

- title.akas.tsv.gz -  
Contains the following information for titles:

 - titleId (string) - a tconst, an alphanumeric unique identifier of the title
 - ordering (integer) – a number to uniquely identify rows for a given titleId
 - title (string) – the localized title
 - region (string) - the region for this version of the title
 - language (string) - the language of the title
 - types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
 - attributes (array) - Additional terms to describe this alternative title, not enumerated
 - isOriginalTitle (boolean) – 0: not original title; 1: original title  
 
 
- title.basics.tsv.gz -   
Contains the following information for titles:
 - tconst (string) - alphanumeric unique identifier of the title
 - titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
 - primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
 - originalTitle (string) - original title, in the original language
 - isAdult (boolean) - 0: non-adult title; 1: adult title
 - startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
 - endYear (YYYY) – TV Series end year. ‘\N’ for all other title types
 - runtimeMinutes – primary runtime of the title, in minutes
 - genres (string array) – includes up to three genres associated with the title  
 
- title.ratings.tsv.gz –   
Contains the IMDb rating and votes information for titles
 - tconst (string) - alphanumeric unique identifier of the title
 - averageRating – weighted average of all the individual user ratings
 - numVotes - number of votes the title has received

## Database Specifications
- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres
- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes
- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

## Preliminary Steps

### Import libraries

In [1]:
import pandas as pd
import pymysql
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.engine import create_engine
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

### Load the data

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
display(basics.head())
display(basics.info())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85625 entries, 0 to 85624
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          85625 non-null  object
 1   titleType       85625 non-null  object
 2   primaryTitle    85625 non-null  object
 3   originalTitle   85625 non-null  object
 4   isAdult         85625 non-null  int64
 5   startYear       85625 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  85625 non-null  int64
 8   genres          85625 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.9+ MB

None

In [3]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
display(ratings.head())
display(ratings.info())

      tconst  averageRating  numVotes
0  tt0000001            5.7      1955
1  tt0000002            5.8       263
2  tt0000005            6.2      2591
3  tt0000006            5.1       177
4  tt0000007            5.4       812

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 490253 entries, 0 to 490252
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         490253 non-null  object
 1   averageRating  490253 non-null  float64
 2   numVotes       490253 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.2+ MB

None

In [4]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
pd.set_option('display.max_column', None)
display(tmdb_df.head())
display(tmdb_df.info())

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.872,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",25.211,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': '/iPLtePguIzOPNtAWfT...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2135.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,Upon discovery of a shard of what could be the...,10.647,/mzOgKYOXiuwE5DIfagFs34bOb3J.jpg,"[{'id': 2216, 'logo_path': None, 'name': 'Helk...","[{'iso_3166_1': 'CA', 'name': 'Canada'}, {'iso...",2000-04-19,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.100,175.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,A film poem inspired by the Peruvian poet Césa...,8.493,/heW06kNneH6nL59h4ZoaODYXFmY.jpg,"[{'id': 157, 'logo_path': None, 'name': 'SVT D...","[{'iso_3166_1': 'SE', 'name': 'Sweden'}, {'iso...",2000-10-06,80334.0,98.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.196,232.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,Vulgar is about a man who is a children's clow...,3.933,/aLdezroGbHDP0w0jOLwxXjgrgma.jpg,"[{'id': 102045, 'logo_path': None, 'name': 'Ch...","[{'iso_3166_1': 'US', 'name': 'United States o...",2002-04-26,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 631 entries, 0 to 630
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                631 non-null    object
 1   adult                  631 non-null    float64
 2   backdrop_path          534 non-null    object
 3   belongs_to_collection  107 non-null    object
 4   budget                 631 non-null    float64
 5   genres                 631 non-null    object
 6   homepage               75 non-null     object
 7   id                     631 non-null    float64
 8   original_language      631 non-null    object
 9   original_title         631 non-null    object
 10  overview               628 non-null    object
 11  popularity             631 non-null    float64
 12  poster_path            612 non-null    object
 13  production_companies   631 non-null    object
 14  production_countries   631 non-null    object
 15  release_date           631 non-null    object
 16  revenue                631 non-null    float64
 17  runtime                631 non-null    float64
 18  spoken_languages       631 non-null    object
 19  status                 631 non-null    object
 20  tagline                491 non-null    object
 21  title                  631 non-null    object
 22  video                  631 non-null    float64
 23  vote_average           631 non-null    float64
 24  vote_count             631 non-null    float64
 25  certification          428 non-null    object
dtypes: float64(9), object(17)
memory usage: 128.3+ KB

None

## Transformations

### Title Basics

#### Convert the single string of genres from title basics into 2 new tables.

Get a list of unique genres

In [5]:
# examine a single value from the genres column
genres = basics.loc[0,"genres"]
print(type(genres))
genres

<class 'str'>

'Comedy,Fantasy,Romance'

In [6]:
# create a column with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics['genres_split'].head()

0    [Comedy, Fantasy, Romance]
1                       [Drama]
2                       [Drama]
3      [Comedy, Horror, Sci-Fi]
4                       [Drama]
Name: genres_split, dtype: object

In [7]:
# use .explode() to separate the list of genres into new rows
exploded = basics.explode('genres_split')
exploded.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

In [8]:
# use .unique() to get the unique genres from the genres_split column
unique_genres = sorted(exploded['genres_split'].dropna().unique())
display(unique_genres)

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

Create a new title_genres table

In [9]:
title_genres = exploded[['tconst', 'genres_split']]
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

Create a genre mapper dictionary to replace string genres with integers

In [10]:
# make a dictionary with the list of unique genres as the key and the new integer id as the value
genre_integers = range(len(unique_genres))
genre_id_map = dict(zip(unique_genres, genre_integers))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

Replace the string genres in title_genres with the new integer ids

In [11]:
# Create a new genre_id column using the genre_map dictionary
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)
# drop the genres_split column
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

/var/folders/_5/txdkxz9d07zcw7bs_mc8cnmr0000gn/T/ipykernel_2260/4010487611.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

Convert the genre map dictionary into a dataframe.

In [12]:
genres = pd.DataFrame({'genre_name': genre_id_map.keys(),
                       'genre_id': genre_id_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### Discard unnecessary information.

In [13]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]

In [14]:
basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres', 'genres_split'])
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

### TMDB

#### Discard unnecessary information

In [15]:
tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.872,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",25.211,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': '/iPLtePguIzOPNtAWfT...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2135.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,Upon discovery of a shard of what could be the...,10.647,/mzOgKYOXiuwE5DIfagFs34bOb3J.jpg,"[{'id': 2216, 'logo_path': None, 'name': 'Helk...","[{'iso_3166_1': 'CA', 'name': 'Canada'}, {'iso...",2000-04-19,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.100,175.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,A film poem inspired by the Peruvian poet Césa...,8.493,/heW06kNneH6nL59h4ZoaODYXFmY.jpg,"[{'id': 157, 'logo_path': None, 'name': 'SVT D...","[{'iso_3166_1': 'SE', 'name': 'Sweden'}, {'iso...",2000-10-06,80334.0,98.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.196,232.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,Vulgar is about a man who is a children's clow...,3.933,/aLdezroGbHDP0w0jOLwxXjgrgma.jpg,"[{'id': 102045, 'logo_path': None, 'name': 'Ch...","[{'iso_3166_1': 'US', 'name': 'United States o...",2002-04-26,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

In [16]:
tmdb_df = tmdb_df[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_df.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0118694  12854953.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0120263     80334.0         0.0           NaN
4  tt0120467     14904.0    120000.0             R

## Database

In [17]:
# create connection string
username = "root"
password = quote_plus("Jake2006!")
db_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [18]:
# create the engine
engine = create_engine(connection_str)

In [19]:
# create a new database
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [20]:
# verify that the database was created
database_exists(connection_str)

True

### title_basics

#### Create a datatype schema for to_sql

Check the dtypes of the dataframe

In [21]:
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

Get the maximum string length for any text column

In [22]:
max_str_len_basics_tconst = basics['tconst'].fillna('').map(len).max()
max_str_len_title = basics['primaryTitle'].fillna('').map(len).max()

Create a dictionary with each column name as a key and the corresponding SQL datatype as the value

In [23]:
basics_sql_datatype = {'tconst': String(max_str_len_basics_tconst+1),
                      'primaryTitle': Text(max_str_len_title+1),
                      'startYear': Float(),
                      'runtimeMinutes': Integer()}

#### Add table to the database

In [24]:
basics.to_sql('title_basics', engine, dtype = basics_sql_datatype, if_exists = 'replace', index = False)

85625

#### Set the desired column as the primary key

In [25]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (tconst);')

#### Show the first 5 rows of the table using a SQL query

In [26]:
query = """
SELECT *
FROM title_basics
LIMIT 5;
"""
pd.read_sql(query, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

### title_ratings

#### Create a datatype schema for to_sql

Check the dtypes of the dataframe

In [27]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

Get the maximum string length for any text column

In [28]:
max_str_len_ratings_tconst = ratings['tconst'].fillna('').map(len).max()

Create a dictionary with each column name as a key and the corresponding SQL datatype as the value

In [29]:
ratings_sql_datatype = {'tconst': String(max_str_len_ratings_tconst+1),
                        'averageRating': Float(),
                        'numVotes': Integer()}

#### Add table to the database

In [30]:
ratings.to_sql('title_ratings', engine, dtype = ratings_sql_datatype, if_exists = 'replace', index = False)

490253

#### Set the desired column as the primary key

In [31]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (tconst);')

#### Show the first 5 rows of the table using a SQL query

In [32]:
query = """
SELECT *
FROM title_ratings
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1955
1  tt0000002            5.8       263
2  tt0000005            6.2      2591
3  tt0000006            5.1       177
4  tt0000007            5.4       812

### title_genres

#### Create a datatype schema for to_sq

Check the dtypes of the dataframe

In [33]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

Get the maximum string length for any text column

In [34]:
max_str_len_title_genres_tconst = title_genres['tconst'].fillna('').map(len).max()

Create a dictionary with each column name as a key and the corresponding SQL datatype as the value

In [35]:
title_genres_sql_datatype = {'tconst': String(max_str_len_title_genres_tconst+1),
                             'genre_id': Integer()}

#### Add table to the database

In [36]:
title_genres.to_sql('title_genres', engine, dtype = title_genres_sql_datatype, if_exists = 'replace', index = False)

159963

#### Show the first 5 rows of the table using a SQL query

In [37]:
query = """
SELECT *
FROM title_genres
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### genres

#### Create a datatype schema for to_sql

Check the dtypes of the dataframe

In [38]:
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

Get the maximum string length for any text column

In [39]:
max_str_len_genre_name = genres['genre_name'].fillna('').map(len).max()

Create a dictionary with each column name as a key and the corresponding SQL datatype as the value

In [40]:
genre_sql_datatype = {'genre_name': Text(max_str_len_genre_name+1),
                      'genre_id': Integer()}

#### Add table to the database

In [41]:
genres.to_sql('genres', engine, dtype = genre_sql_datatype, if_exists = 'replace', index = False)

26

#### Set the desired column as the primary key

In [42]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (genre_id);')

#### Show the first 5 rows of the table using a SQL query

In [43]:
query = """
SELECT *
FROM genres
LIMIT 5;
"""
pd.read_sql(query, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data

#### Create a datatype schema for to_sql

Check the dtypes of the dataframe

In [44]:
tmdb_df.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

Get the maximum string length for any text column

In [45]:
max_str_len_imdb_id = tmdb_df['imdb_id'].fillna('').map(len).max()
max_str_len_certification = tmdb_df['certification'].fillna('').map(len).max()

Create a dictionary with each column name as a key and the corresponding SQL datatype as the value

In [46]:
tmdb_sql_datatype = {'imdb_id': String(max_str_len_imdb_id+1),
                     'revenue': Float(),
                     'budget': Float(),
                     'certification': Text(max_str_len_certification+1)}

#### Add table to the database

In [47]:
tmdb_df.to_sql('tmdb_data', engine, dtype = tmdb_sql_datatype, if_exists = 'replace', index = False)

631

#### Set the desired column as the primary key

In [48]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (imdb_id);')

#### Show the first 5 rows of the table using a SQL query

In [49]:
query = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(query, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0118589   5271670.0  22000000.0         PG-13
3  tt0118652         0.0   1000000.0             R
4  tt0118694  12855000.0    150000.0            PG

In [50]:
# test the database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data